import React from "react";
import img2 from "./img/main-news1.jpg";
import img1 from "./img/pinarayi.jpg";
import Column from "../../components/Layouts/Column/Column";
import TextOnImg from "../../components/Layouts/TextOnImg/TextOnImg";
import sushand from "./img/sushand.jpg";
import { Container, Row, Col } from "react-bootstrap";

const LatestNews = [
	<Column img={img2} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
	<Column img={img1} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
	<Column img={img1} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
	<Column img={img1} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
	<Column img={img1} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
	<Column img={img1} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
];

const TopNews = [
	<Column img={img2} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
	<Column img={img1} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
	<Column img={img1} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
	<Column img={img2} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
	<Column img={img1} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
	<Column img={img1} text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"></Column>,
];

const Popular = [
	<Column
		mainText="കേരള പൊലീസിനു ക്ഷീണം; 24 മണിക്കൂറിൽ പ്രതികളെ വലയിലാക്കി എൻഐഎ മികവ്..."
		text="കേസ് ഏറ്റെടുത്ത് ഒറ്റദിവസം കൊണ്ട് പ്രതികളെ പിടികൂടി എൻഎഎ മികവ് തെളിയിച്ചു. ഒപ്പം കസ്റ്റംസിനു പിന്നാല...കേസ് ഏറ്റെടുത്ത് ഒറ്റദിവസം കൊണ്ട് പ്രതികളെ പിടികൂടി എൻഎഎ മികവ് തെളിയിച്ചു. ഒപ്പം കസ്റ്റംസിനു പിന്നാല..."
	></Column>,
	<Column
		mainText="കേരള പൊലീസിനു ക്ഷീണം; 24 മണിക്കൂറിൽ പ്രതികളെ വലയിലാക്കി എൻഐഎ മികവ്..."
		text="കേസ് ഏറ്റെടുത്ത് ഒറ്റദിവസം കൊണ്ട് പ്രതികളെ പിടികൂടി എൻഎഎ മികവ് തെളിയിച്ചു. ഒപ്പം കസ്റ്റംസിനു പിന്നാല...കേസ് ഏറ്റെടുത്ത് ഒറ്റദിവസം കൊണ്ട് പ്രതികളെ പിടികൂടി എൻഎഎ മികവ് തെളിയിച്ചു. ഒപ്പം കസ്റ്റംസിനു പിന്നാല..."
	></Column>,
	<Column
		mainText="കേരള പൊലീസിനു ക്ഷീണം; 24 മണിക്കൂറിൽ പ്രതികളെ വലയിലാക്കി എൻഐഎ മികവ്..."
		text="കേസ് ഏറ്റെടുത്ത് ഒറ്റദിവസം കൊണ്ട് പ്രതികളെ പിടികൂടി എൻഎഎ മികവ് തെളിയിച്ചു. ഒപ്പം കസ്റ്റംസിനു പിന്നാല...കേസ് ഏറ്റെടുത്ത് ഒറ്റദിവസം കൊണ്ട് പ്രതികളെ പിടികൂടി എൻഎഎ മികവ് തെളിയിച്ചു. ഒപ്പം കസ്റ്റംസിനു പിന്നാല..."
	></Column>,
	<Column
		mainText="കേരള പൊലീസിനു ക്ഷീണം; 24 മണിക്കൂറിൽ പ്രതികളെ വലയിലാക്കി എൻഐഎ മികവ്..."
		text="കേസ് ഏറ്റെടുത്ത് ഒറ്റദിവസം കൊണ്ട് പ്രതികളെ പിടികൂടി എൻഎഎ മികവ് തെളിയിച്ചു. ഒപ്പം കസ്റ്റംസിനു പിന്നാല...കേസ് ഏറ്റെടുത്ത് ഒറ്റദിവസം കൊണ്ട് പ്രതികളെ പിടികൂടി എൻഎഎ മികവ് തെളിയിച്ചു. ഒപ്പം കസ്റ്റംസിനു പിന്നാല..."
	></Column>,
	<Column
		mainText="കേരള പൊലീസിനു ക്ഷീണം; 24 മണിക്കൂറിൽ പ്രതികളെ വലയിലാക്കി എൻഐഎ മികവ്..."
		text="കേസ് ഏറ്റെടുത്ത് ഒറ്റദിവസം കൊണ്ട് പ്രതികളെ പിടികൂടി എൻഎഎ മികവ് തെളിയിച്ചു. ഒപ്പം കസ്റ്റംസിനു പിന്നാല...കേസ് ഏറ്റെടുത്ത് ഒറ്റദിവസം കൊണ്ട് പ്രതികളെ പിടികൂടി എൻഎഎ മികവ് തെളിയിച്ചു. ഒപ്പം കസ്റ്റംസിനു പിന്നാല..."
	></Column>,
];

const Trending = [
	<Column text="തിരുവനന്തപുരം ശ്രീ പത്മനാഭസ്വാമി ക്ഷേത്രം സംസ്ഥാന സർക്കാർ ഏറ്റെടുക്കണമെന്ന ഹൈക്കോടതി വിധിക്കെതിരെയുള..."></Column>,
	<Column text="തിരുവനന്തപുരം ശ്രീ പത്മനാഭസ്വാമി ക്ഷേത്രം സംസ്ഥാന സർക്കാർ ഏറ്റെടുക്കണമെന്ന ഹൈക്കോടതി വിധിക്കെതിരെയുള..."></Column>,
	<Column text="തിരുവനന്തപുരം ശ്രീ പത്മനാഭസ്വാമി ക്ഷേത്രം സംസ്ഥാന സർക്കാർ ഏറ്റെടുക്കണമെന്ന ഹൈക്കോടതി വിധിക്കെതിരെയുള..."></Column>,
	<Column text="തിരുവനന്തപുരം ശ്രീ പത്മനാഭസ്വാമി ക്ഷേത്രം സംസ്ഥാന സർക്കാർ ഏറ്റെടുക്കണമെന്ന ഹൈക്കോടതി വിധിക്കെതിരെയുള..."></Column>,
	<Column text="തിരുവനന്തപുരം ശ്രീ പത്മനാഭസ്വാമി ക്ഷേത്രം സംസ്ഥാന സർക്കാർ ഏറ്റെടുക്കണമെന്ന ഹൈക്കോടതി വിധിക്കെതിരെയുള..."></Column>,
	<Column text="തിരുവനന്തപുരം ശ്രീ പത്മനാഭസ്വാമി ക്ഷേത്രം സംസ്ഥാന സർക്കാർ ഏറ്റെടുക്കണമെന്ന ഹൈക്കോടതി വിധിക്കെതിരെയുള..."></Column>,
];

const Featured = [
	<Column
		img={img1}
		text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"
		imgFill={true}
	></Column>,
	<Column
		img={img1}
		text="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം"
		imgFill={true}
	></Column>,
];

const Photos = [
	<TextOnImg
		img={sushand}
		text="
ഞങ്ങളുടെ ഓൺലൈൻ സോഫ്റ്റ്വെയർ പര . . ."
		subText="മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം ചെയ്യുന്ന പ്രക്രിയ വളരെ വേഗത്തിലാ . . ."
	></TextOnImg>,
	<Container>
		<Row>
			<Col xs={6}>
				<TextOnImg
					img={sushand}
					text="
ഞങ്ങളുടെ ഓൺലൈൻ സോഫ്റ്റ്വെയർ പര . . .മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം ചെയ്യുന്ന പ്രക്രിയ വളരെ വേഗത്തിലാ . . ."
				></TextOnImg>
			</Col>
			<Col xs={6}>
				<TextOnImg
					img={sushand}
					text="
ഞങ്ങളുടെ ഓൺലൈൻ സോഫ്റ്റ്വെയർ പര . . .മലയാളത്തിലേക്ക് ഇംഗ്ലീഷ് ലിപ്യന്തരണം ചെയ്യുന്ന പ്രക്രിയ വളരെ വേഗത്തിലാ . . ."
				></TextOnImg>
			</Col>
		</Row>
	</Container>,
];

export { LatestNews, TopNews, Popular, Trending, Featured, Photos };
